In [134]:
import pandas as pd

In [132]:
def crear_columnas(tabla_original, columna_a_conservar, columna_a_expandir):
  tabla_nueva = pd.DataFrame({columna_a_conservar:tabla_original[columna_a_conservar].unique()}).set_index(columna_a_conservar)
  for cid in tabla_original[columna_a_conservar].unique():
    for i in range(sum(tabla_original[columna_a_conservar] == cid)):
      tabla_nueva.loc[cid,i+1] = tabla_original[tabla_original[columna_a_conservar]==cid][columna_a_expandir].reset_index().loc[i].at[columna_a_expandir]
  return tabla_nueva

In [135]:
tabla_original = pd.DataFrame({'fecha':['10-ene',
                                        '10-feb',
                                        '10-mar',
                                        '10-mar',
                                        '10-abr',
                                        '10-ene'],
                               'clientID':[123,
                                           123,
                                           123,
                                           456,
                                           789,
                                           1011]})

In [136]:
tabla_original

    fecha  clientID
0  10-ene       123
1  10-feb       123
2  10-mar       123
3  10-mar       456
4  10-abr       789
5  10-ene      1011

In [137]:
crear_columnas(tabla_original,'clientID','fecha')

               1       2       3
clientID
123       10-ene  10-feb  10-mar
456       10-mar     NaN     NaN
789       10-abr     NaN     NaN
1011      10-ene     NaN     NaN